[
  {
    "id": "intro",
    "name": "intro",
    "title": "Overview",
    "content": "## Senior Full-Stack & Platform Engineer\nI design and ship production systems where product velocity and platform reliability meet. Recent work spans low-latency messaging, partner integrations, and shared tooling that standardizes observability and security across services.\n\n**Primary stack**: TypeScript/React • Node.js • Python • Postgres/MySQL/Redis • Kubernetes • GCP\n\n**Quick links**: [GitHub](https://github.com/Jdubz) • [LinkedIn](https://www.linkedin.com/in/joshwentworth/) • [Email](mailto:contact@joshwentworth.com)\n\n*I build user-facing features on top of solid platforms—measurable reliability, happy developers, faster product cycles.*",
    "order": 1,
    "type": "page",
    "createdAt": "2025-10-09T17:29:30.000Z",
    "updatedAt": "2025-10-15T20:00:48.672Z",
    "createdBy": "contact@joshwentworth.com",
    "updatedBy": "contact@joshwentworth.com"
  },
  {
    "id": "selected-projects",
    "name": "selected-projects",
    "title": "Selected Projects",
    "content": "## Profile website\nThis website is a full stack application meant to demonstrate some of my skills.\n**Stack**: React • Gatsby • Theme UI • Nodejs • Express • Firebase • Google Cloud Functions • Firebase Auth • Firestore \n[Source Code](https://github.com/Jdubz/portfolio)\n\n## Audio-Reactive LED Fire-Totem\nReal-time mic/IMU pipeline (C++/Arduino) with adaptive gain, serial console, and 16×8 WS2812 flame visualization. Emphasizes DSP, performance under constraints, and param UX.\n**Stack**: C++ • Arduino • Rhino Cad • AI electrical advice from ChatGPT\n[Source Code](https://github.com/Jdubz/blinky_time)",
    "order": 2,
    "type": "page",
    "createdAt": "2025-10-09T17:39:49.000Z",
    "updatedAt": "2025-10-15T20:00:48.881Z",
    "createdBy": "contact@joshwentworth.com",
    "updatedBy": "jess.castaldi@gmail.com"
  },
  {
    "id": "skills",
    "name": "skills",
    "title": "Skills & Technologies",
    "content": "- **Frontend** - Angular, React, Mobx, Sentry, tailwind, shadcn, bootstrap, themeui, materialui, styled components\n- **Backend** — nodejs, express, apollo, python, Flask, C++\n- **Platform** — GCP, Linux, Docker \n- **Integrations** — Doordash Marketplce, Doordash Drive, Uber Eats Marketplace, Stripe, Taxjar, Contentful, Twilio, SendGrid, PagerDuty, Slack\n- **Messaging / queues** — BullMQ, RabbitMQ, Pub/Sub\n- **Performance** — Lighthouse\n- **Reliability** — SLAs, incident response, error budgets  \n- **Observability** — Sentry, Promethius, Elasctic, Google Stacktrace, PagerDuty\n- **Security** — redaction/PII, authN/Z patterns, signatures  \n- **Payments / tax** — Stripe, TaxJar, reconciliation, audits  \n- **UX / AB testing** — funnels, flags, experimentation  \n- **GCP / Kubernetes / Redis / Postgres / Typescript** — technology anchors\n- **Unit / Regression Testing** - Jest, Mocha, Chai, Playwright, Cypress\n- **Authentication** - JWT, Oauth2.0",
    "order": 3,
    "type": "page",
    "createdAt": "2025-10-09T17:41:26.000Z",
    "updatedAt": "2025-10-15T20:00:49.017Z",
    "createdBy": "contact@joshwentworth.com",
    "updatedBy": "jess.castaldi@gmail.com"
  },
  {
    "id": "education-certificates",
    "name": "education-certificates",
    "title": "Education & Certificates",
    "content": "### **Google Cloud Professional Cloud Developer** (2019–2021)\n\n### **Hack Reactor**\nSoftware Engineering Bootcamp (Completed May 2016)\n\n### **UCSC — B.A. in Classical Western Music** (May 2009)\nminors in Electronic Music & Jazz  \n**Regents scholar** - top 1% of incoming freshmen, 4.5 GPA from high school with top SAT scores.",
    "order": 4,
    "type": "page",
    "createdAt": "2025-10-09T17:45:16.000Z",
    "updatedAt": "2025-10-15T20:00:48.538Z",
    "createdBy": "contact@joshwentworth.com",
    "updatedBy": "contact@joshwentworth.com"
  },
  {
    "id": "biography",
    "name": "biography",
    "title": "Biography",
    "content": "As a lifelong type 1 diabetic (diagnosed at 18 months), I’ve always had a distinct perspective on risk and responsibility. Confronting mortality so young meant learning to enjoy life and pursue goals, playing on sports teams, traveling, without compromising my ability to manage my condition. Living with continual frustrations taught me to stay calm where others might panic; I make sound decisions under pressure and handle situations appropriately.\n\nI studied music at UCSC after being awarded the Regents Scholarship (a full ride for grades and test scores). I originally started as a dual major in Physics and Chemistry, but quickly realized that, during a period of growth and experimentation, music was more engaging than mathematics. In the electronic music program, I discovered computers as a creative medium for music, video, and interactivity. That exploration led me to build a Max/MSP program that triggered lighting and video changes based on musical events, using an adaptive listening algorithm informed by music theory. That project launched my tech career.\n\nAs I developed the tool further, I adopted TouchDesigner, extending the system with GLSL and Python. I began building installations for large social media companies, bridging the gap between their online following and live events. The goal was to create a feedback loop between celebrities and their followers (moderated by a marketing team). These experiences reinforced my ability to perform under pressure: live broadcasts that depended on my tools reached millions of viewers and allowed no delays. I had to deliver zero-tolerance software with no room for error.\n\nThroughout my career, I’ve enjoyed applying professional skills to artistic endeavors, especially those that build community. I grew up working in my father’s CNC machine shop, and it has never occurred to me that there’s anything I can’t create (which has also led to many valuable learning opportunities). Trying, adapting, and overcoming new challenges has been part of my personality for as long as I can remember. Not knowing exactly how to do something is a powerful motivator; learning is a reward beyond the success of any single project.\n\nUsing technology to foster connection is a big part of my life. Professionally, that meant strengthening relationships between a brand and its customers, and later between users and the tools I built. In personal projects, I focused on bringing people together, sometimes by crafting fun, engaging environments, and other times by proposing playful icebreakers and ways to interact that go beyond small talk without being intrusive.\n\nAs a creative technologist and community leader, I thrive in social environments where teams work toward a common goal. I handle pressure well and even enjoy it in moderation. Wherever life leads me, I plan to keep living these ideals in both my professional and personal life.",
    "order": 5,
    "type": "page",
    "createdAt": "2025-10-09T18:04:48.000Z",
    "updatedAt": "2025-10-15T20:00:48.165Z",
    "createdBy": "contact@joshwentworth.com",
    "updatedBy": "contact@joshwentworth.com"
  },
  {
    "id": "closing-notes",
    "name": "closing-notes",
    "title": "Closing Notes",
    "content": "Open to Senior/Staff Full-Stack roles at the app/infra boundary. I love pairing, mentoring, and raising the quality bar.\nContact: contact@joshwentworth.com\n • Portland, OR / Remote",
    "order": 6,
    "type": "page",
    "createdAt": "2025-10-09T18:06:37.000Z",
    "updatedAt": "2025-10-15T20:00:48.326Z",
    "createdBy": "contact@joshwentworth.com",
    "updatedBy": "contact@joshwentworth.com"
  }
]